def book_list_view(library):
    if not library:
        print("В библиотеке нет книг.")
    else:
        print("Список книг в библиотеке:")
        for title in library:
            print(title)


library = {
    "Мастер и Маргарита" : {
        "автор" : "Михаил Булгаков",
        "год издания" : 1940,
        "наличие" : True
    },
    "Евгений Онегин" : {
        "автор" : "Александр Пушкин",
        "год издания" : 1830,
        "наличие" : False
    },
    "Герой нашего времени": {
        "автор": "Михаил Лермонтов",
        "год издания": 1840,
        "наличие": True
    },
    "Анна Каренина": {
        "автор": "Лев Толстой",
        "год издания": 1873,
        "наличие": False
    },
    "Преступление и наказание": {
        "автор": "Федор Достоевский",
        "год издания": 1866,
        "наличие": True
    }
}

book_list_view(library)